app/views/employees/show.html.erb

SELECT  "assignments".* FROM "assignments" WHERE "assignments"."employee_id" = ? ORDER BY "assignments"."id" ASC LIMIT ?  [["employee_id", 170], ["LIMIT", 1]]
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<p>
    <% if @employee.assignments.first !=nil  %>
  <%= @employee.assignments.first.store.name%>

SELECT  "assignments".* FROM "assignments" WHERE "assignments"."employee_id" = ? AND (end_date IS NULL) ORDER BY "assignments"."id" ASC LIMIT ?  [["employee_id", 260], ["LIMIT", 1]]
---
<p>
  <% if @employee.assignments.current.first !=nil  %>