app/views/assignments/show.html.erb

SELECT "shifts".* FROM "shifts" WHERE "shifts"."assignment_id" = ?  [["assignment_id", 15]]
---
<p>
  <%= @assignment.shifts.each do |shift| %>