lib/tasks/helpers/employees.rb

    def create_admins
      # Step 1a: Add Alex as admin
      ae = Employee.new
      ae.first_name = 'Alex'
      ae.last_name = 'Heimann'
      ae.ssn = '123456789'
      ae.date_of_birth = '1993-01-25'
      ae.phone = '412-268-3259'
      ae.role = 'admin'
      ae.active = true
      ae.username = 'admin'
      ae.password = 'secret'
      ae.password_confirmation = 'secret'
      ae.save!

      # Step 1b: Add Mark as admin
      me = Employee.new
      me.first_name = 'Mark'
      me.last_name = 'Heimann'
      me.ssn = '987654321'
      me.date_of_birth = '1993-01-25'
      me.phone = '412-268-8211'
      me.active = true
      me.role = 'admin'
      me.username = 'user'
      me.password = 'secret'
      me.password_confirmation = 'secret'
      me.save!
---
INSERT INTO "employees" ("first_name", "last_name", "ssn", "date_of_birth", "phone", "role", "active") VALUES (?, ?, ?, ?, ?, ?, ?)  [["first_name", "Alex"], ["last_name", "Heimann"], ["ssn", "123456789"], ["date_of_birth", "1993-01-25"], ["phone", "4122683259"], ["role", "admin"], ["active", 1]]
INSERT INTO "employees" ("first_name", "last_name", "ssn", "date_of_birth", "phone", "role", "active") VALUES (?, ?, ?, ?, ?, ?, ?)  [["first_name", "Mark"], ["last_name", "Heimann"], ["ssn", "987654321"], ["date_of_birth", "1993-01-25"], ["phone", "4122688211"], ["role", "admin"], ["active", 1]]