app/views/pay_grades/show.html.erb

    <tr>
    <% @pay_grade.pay_grade_rates.each do |s| %>
---
SELECT "pay_grade_rates".* FROM "pay_grade_rates" WHERE "pay_grade_rates"."pay_grade_id" = ?  [["pay_grade_id", 1]]