app/controllers/assignments_controller.rb

  def index
    # for phase 3 only
      @current_assignments = Assignment.current.chronological.paginate(page: params[:page]).per_page(10)
---
SELECT  "assignments".* FROM "assignments" WHERE (end_date IS NOT NULL) ORDER BY start_date DESC, end_date DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "assignments" WHERE (end_date IS NOT NULL)

  def set_assignment
    @assignment = Assignment.find(params[:id])
---
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]