app/controllers/employees_controller.rb

  def index
    # for phase 3 only
    @employees = Employee.all.active.paginate(page: params[:page]).per_page(10)
---
SELECT  "employees".* FROM "employees" WHERE (role = 'employee') AND "employees"."active" = ? AND "employees"."active" = ? ORDER BY last_name, first_name LIMIT ? OFFSET ?  [["active", 1], ["active", 1], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "employees" WHERE (role = 'manager') AND "employees"."active" = ?  [["active", 1]]

  def create
    @employee = Employee.new(employee_params)
    if @employee.save
---
INSERT INTO "employees" ("first_name", "last_name", "ssn", "date_of_birth", "phone", "role", "username", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def retrieve_employee_assignments
    @current_assignment = @employee.current_assignment
    @previous_assignments = @employee.assignments.to_a - [@current_assignment]
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."employee_id" = ?  [["employee_id", 3]]