app/controllers/pay_grades_controller.rb

SELECT COUNT(*) FROM "pay_grades"
SELECT  "pay_grades".* FROM "pay_grades" WHERE "pay_grades"."active" = ? ORDER BY level LIMIT ? OFFSET ?  [["active", 1], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "pay_grades" WHERE "pay_grades"."active" = ?  [["active", 1]]
---
  def index
      @paygrades = PayGrade.all.paginate(page: params[:page]).per_page(10)
      @active_grades = PayGrade.active.alphabetical.paginate(page: params[:page]).per_page(10)

SELECT  "pay_grades".* FROM "pay_grades" WHERE "pay_grades"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_pay_grade
    @pay_grade = PayGrade.find(params[:id])