app/controllers/pay_grade_rates_controller.rb

  def index
      @current_rate = PayGradeRate.current.chronological.paginate(page: params[:page]).per_page(10)
---
SELECT COUNT(*) FROM "pay_grade_rates" WHERE (end_date IS NULL)