app/controllers/shifts_controller.rb

SELECT COUNT(*) FROM "shifts"
---
  def index
    #   if current_user && current_user.role?(:admin)
    @shifts = Shift.all.paginate(page: params[:page]).per_page(10)