app/controllers/stores_controller.rb

  def index
    # get data on all stores and paginate the output to 10 per page
    @stores = Store.all.alphabetical.paginate(page: params[:page]).per_page(10)
    @active_stores = Store.active.alphabetical.paginate(page: params[:page]).per_page(10)
---
SELECT COUNT(*) FROM "stores"
SELECT  "stores".* FROM "stores" WHERE "stores"."active" = ? AND "stores"."active" != ? ORDER BY name LIMIT ? OFFSET ?  [["active", 1], ["active", 1], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "stores" WHERE "stores"."active" != ?  [["active", 1]]

  def show
    @current_managers = @store.assignments.current.map{|a| a.employee}.sort_by{|e| e.name}.select{|e| e.role == 'manager'}
    @current_employees = @store.assignments.current.map{|a| a.employee}.sort_by{|e| e.name}
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."store_id" = ? AND (end_date IS NULL)  [["store_id", 1]]

  def set_store
    @store = Store.find(params[:id])
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]