app/models/employee.rb

SELECT  1 AS one FROM "assignments" WHERE "assignments"."employee_id" = ? AND (end_date IS NULL) LIMIT ?  [["employee_id", 3], ["LIMIT", 1]]
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."employee_id" = ? AND (end_date IS NULL) ORDER BY "assignments"."id" ASC LIMIT ?  [["employee_id", 3], ["LIMIT", 1]]
---
  def current_assignment
    curr_assignment = self.assignments.current
    return nil if curr_assignment.empty?
    curr_assignment.first   # return as a single object, not an array